miyatsuko_test1/app/views/employees/new.html.erb

    <div class='col-sm-5 x-content'>
      <%= f.select(:section_id, relation_select(:Section, :id, :sec_name), {}, { class: "form-control", data: { name: "@employee.section_id", relation: "Section", column: "sec_name"}}) %></div>
---
SELECT "sections"."sec_name", "sections"."id" FROM "sections"